#Напишите программу, которая будет преобразовывать десятичное число в двоичное.
n = int(input())
print(bin(n))